RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_flexcan.c
    return (uint32_t)(handle->timestamp[mbIdx]);
}

/*!
 * brief Check unhandle interrupt events
 *
 * param base FlexCAN peripheral base address.
 * return TRUE if unhandled interrupt action exist, FALSE if no unhandlered interrupt action exist.
 */
static bool FLEXCAN_CheckUnhandleInterruptEvents(CAN_Type *base)
{
    uint64_t tempmask;
    uint64_t tempflag;
    bool fgRet = false;

    if (0U == (FLEXCAN_GetStatusFlags(base) &   \
              (FLEXCAN_ERROR_AND_STATUS_INT_FLAG | FLEXCAN_WAKE_UP_FLAG | FLEXCAN_MEMORY_ENHANCED_RX_FIFO_INT_FLAG)))
    {
        /* If no error, wake_up or enhanced RX FIFO status, Checking whether exist MB interrupt status and legacy RX
         * FIFO interrupt status */
        tempmask = (uint64_t)base->IMASK1;
        tempflag = (uint64_t)base->IFLAG1;
#if defined(CAN_IMASK2_BUF63TO32M_MASK)
        if (FSL_FEATURE_FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(base) > 32)
        {
            tempmask |= ((uint64_t)base->IMASK2) << 32;
            tempflag |= ((uint64_t)base->IFLAG2) << 32;
        }
#endif
        fgRet = (0U != (tempmask & tempflag));
#if defined(CAN_IMASK3_BUF95TO64M_MASK)
        if (FSL_FEATURE_FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(base) > 64)
        {
            if (0U != (base->IMASK3 & base->IFLAG3))
            {
                fgRet = true;
            }
        }
#endif
#if defined(CAN_IMASK4_BUF127TO96M_MASK)
        if (FSL_FEATURE_FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(base) > 96)
        {
            if (0U != (base->IMASK4 & base->IFLAG4))
            {
                fgRet = true;
            }
        }
#endif
    }
#if (defined(FSL_FEATURE_FLEXCAN_HAS_ENHANCED_RX_FIFO) && FSL_FEATURE_FLEXCAN_HAS_ENHANCED_RX_FIFO)
    else if (0U != (FLEXCAN_GetStatusFlags(base) & FLEXCAN_MEMORY_ENHANCED_RX_FIFO_INT_FLAG))
    {
        /* Checking whether exist enhanced RX FIFO interrupt status. */
        tempmask = (uint64_t)base->ERFIER;
        tempflag = (uint64_t)base->ERFSR;
        fgRet    = (0U != (tempmask & tempflag));
    }
#endif
    else
    {
        /* Exist error or wake up flag. */
        fgRet = true;
    }

    return fgRet;
}

/*!
 * brief Sub Handler Legacy Rx FIFO Trasfered Events
 *
 * param base FlexCAN peripheral base address.
 * param handle FlexCAN handle pointer.
 * param result The MB flag number.
 *
 * return the status after handle transfered event.
 */
static status_t FLEXCAN_SubHandlerForLegacyRxFIFO(CAN_Type *base, flexcan_handle_t *handle, uint32_t result)
{
    uint32_t u32mask = 1;
    status_t status  = kStatus_FLEXCAN_UnHandled;

    switch (u32mask << result)
    {
        case kFLEXCAN_RxFifoOverflowFlag:
            status = kStatus_FLEXCAN_RxFifoOverflow;
            break;

        case kFLEXCAN_RxFifoWarningFlag:
            if ((handle->rxFifoFrameNum > 5U) && (0U != (base->IFLAG1 & (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag)))
            {
                for (uint32_t i = 0; i < 5UL; i++)
                {
                    status = FLEXCAN_ReadRxFifo(base, handle->rxFifoFrameBuf);
                    /*
                     * $Branch Coverage Justification$
                     * (kStatus_Success != status) not covered. $ref flexcan_c_ref_1$.
                     */
                    if (kStatus_Success == status)
                    {
                        /* Align the current rxfifo timestamp to the timestamp array by handle. */
                        handle->timestamp[i] = handle->rxFifoFrameBuf->timestamp;
                        handle->rxFifoFrameBuf++;
                        handle->rxFifoFrameNum--;
                        /* Clean Rx Fifo available flag to discard the frame that has been read. */
                        FLEXCAN_ClearMbStatusFlags(base, (uint64_t)kFLEXCAN_RxFifoFrameAvlFlag);
                    }
                    else
                    {
                        /*
                         * $Line Coverage Justification$
                         * $ref flexcan_c_ref_1$.
                         */
                        return kStatus_FLEXCAN_RxFifoDisabled;
                    }
                }
                if (handle->rxFifoFrameNum < 5UL)
                {
                    /* Enable data avaliable interrupt. */
                    FLEXCAN_EnableMbInterrupts(base, (uint64_t)kFLEXCAN_RxFifoFrameAvlFlag);
                }
                status = kStatus_FLEXCAN_RxFifoBusy;
            }
            else
            {
                /* Should enter case kFLEXCAN_RxFifoFrameAvlFlag but not, means previous transfer may have
                 * overflow*/
                status = kStatus_FLEXCAN_RxFifoWarning;
            }
            break;

        case kFLEXCAN_RxFifoFrameAvlFlag:
            /* Whether still has CAN messages remaining to be received. */
            if (handle->rxFifoFrameNum > 0U)
            {
                status = FLEXCAN_ReadRxFifo(base, handle->rxFifoFrameBuf);
                /*
                 * $Branch Coverage Justification$
                 * (kStatus_Success != status) not covered. $ref flexcan_c_ref_1$.
                 */
                if (kStatus_Success == status)
                {
                    /* Align the current (index 0) rxfifo timestamp to the timestamp array by handle. */
                    handle->timestamp[0] = handle->rxFifoFrameBuf->timestamp;
                    handle->rxFifoFrameBuf++;
                    handle->rxFifoFrameNum--;
                }
                else
                {
                    /*
                     * $Line Coverage Justification$
                     * $ref flexcan_c_ref_1$.
                     */
                    return kStatus_FLEXCAN_RxFifoDisabled;
                }
            }
            if (handle->rxFifoFrameNum == 0U)
            {
                /* Stop receiving Ehanced Rx FIFO when the transmission is over. */
                FLEXCAN_TransferAbortReceiveFifo(base, handle);
                status = kStatus_FLEXCAN_RxFifoIdle;
            }
            else
            {
                /* Continue use data avaliable interrupt. */
                status = kStatus_FLEXCAN_RxFifoBusy;
            }
            break;

        default:
            status = kStatus_FLEXCAN_UnHandled;
            break;
    }

