RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_flexcan.c
    return status;
}

/*!
 * brief Sub Handler Message Buffer Trasfered Events
 *
 * param base FlexCAN peripheral base address.
 * param handle FlexCAN handle pointer.
 * param result The MB flag number.
 *
 * return the status after handle transfered event.
 */
static status_t FLEXCAN_SubHandlerForMB(CAN_Type *base, flexcan_handle_t *handle, uint32_t result)
{
    status_t status = kStatus_FLEXCAN_UnHandled;

    /* Get current State of Message Buffer. */
    switch (handle->mbState[result])
    {
        /* Solve Rx Data Frame. */
        case (uint8_t)kFLEXCAN_StateRxData:
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
            if (0U != (base->MCR & CAN_MCR_FDEN_MASK))
            {
                status = FLEXCAN_ReadFDRxMb(base, (uint8_t)result, handle->mbFDFrameBuf[result]);
                if ((kStatus_Success == status) || (kStatus_FLEXCAN_RxOverflow == status))
                {
                    /* Align the current index of RX MB timestamp to the timestamp array by handle. */
                    handle->timestamp[result] = handle->mbFDFrameBuf[result]->timestamp;

                    if (kStatus_Success == status)
                    {
                        status = kStatus_FLEXCAN_RxIdle;
                    }
                }
            }
            else
#endif
            {
                status = FLEXCAN_ReadRxMb(base, (uint8_t)result, handle->mbFrameBuf[result]);
                if ((kStatus_Success == status) || (kStatus_FLEXCAN_RxOverflow == status))
                {
                    /* Align the current index of RX MB timestamp to the timestamp array by handle. */
                    handle->timestamp[result] = handle->mbFrameBuf[result]->timestamp;

                    if (kStatus_Success == status)
                    {
                        status = kStatus_FLEXCAN_RxIdle;
                    }
                }
            }
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
            if (0U != (base->MCR & CAN_MCR_FDEN_MASK))
            {
                FLEXCAN_TransferFDAbortReceive(base, handle, (uint8_t)result);
            }
            else
#endif
            {
                FLEXCAN_TransferAbortReceive(base, handle, (uint8_t)result);
            }
            break;

        /* Solve Rx Remote Frame. User need to Read the frame in Mail box in time by Read from MB API. */
        case (uint8_t)kFLEXCAN_StateRxRemote:
            status = kStatus_FLEXCAN_RxRemote;
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
            if (0U != (base->MCR & CAN_MCR_FDEN_MASK))
            {
                FLEXCAN_TransferFDAbortReceive(base, handle, (uint8_t)result);
            }
            else
#endif
            {
                FLEXCAN_TransferAbortReceive(base, handle, (uint8_t)result);
            }
            break;

        /* Solve Tx Data Frame. */
        case (uint8_t)kFLEXCAN_StateTxData:
            status = kStatus_FLEXCAN_TxIdle;
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
            if (0U != (base->MCR & CAN_MCR_FDEN_MASK))
            {
                FLEXCAN_TransferFDAbortSend(base, handle, (uint8_t)result);
            }
            else
#endif
            {
                FLEXCAN_TransferAbortSend(base, handle, (uint8_t)result);
            }
            break;

        /* Solve Tx Remote Frame. */
        case (uint8_t)kFLEXCAN_StateTxRemote:
            handle->mbState[result] = (uint8_t)kFLEXCAN_StateRxRemote;
            status                  = kStatus_FLEXCAN_TxSwitchToRx;
            break;

        default:
            status = kStatus_FLEXCAN_UnHandled;
            break;
    }

    return status;
}

/*!
 * brief Sub Handler Data Trasfered Events
 *
 * param base FlexCAN peripheral base address.
 * param handle FlexCAN handle pointer.
 * param startMbIdx First Message Buffer to handle.
 * param endMbIdx Last Message Buffer to handle.
 * param pResult Pointer to the Handle result.
 *
 * return the status after handle each data transfered event.
 */
static status_t FLEXCAN_SubHandlerForDataTransfered(CAN_Type *base,
                                                    flexcan_handle_t *handle,
                                                    uint32_t startMbIdx,
                                                    uint32_t endMbIdx,
                                                    uint32_t *pResult)
{
    status_t status = kStatus_FLEXCAN_UnHandled;
    uint32_t result = 0xFFU;

    uint32_t intflag[4] = {(base->IMASK1 & base->IFLAG1), 0U, 0U, 0U};
#if defined(CAN_IMASK2_BUF63TO32M_MASK)
    if (FSL_FEATURE_FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(base) > 32)
    {
        intflag[1] = base->IMASK2 & base->IFLAG2;
    }
#endif
#if defined(CAN_IMASK3_BUF95TO64M_MASK)
    if (FSL_FEATURE_FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(base) > 64)
    {
        intflag[2] = base->IMASK3 & base->IFLAG3;
    }
#endif
#if defined(CAN_IMASK4_BUF127TO96M_MASK)
    if (FSL_FEATURE_FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(base) > 96)
    {
        intflag[3] = base->IMASK4 & base->IFLAG4;
    }
#endif

    /* For this implementation, we solve the Message with lowest MB index first. */
    uint32_t startIdx = startMbIdx / 32U;
    uint32_t endIdx = endMbIdx / 32U;
    uint32_t bitStart;
    uint32_t bitEnd;

    for (uint32_t i = startIdx; i <= endIdx; i++)
    {
        if (intflag[i] != 0U)
        {
            bitStart = (i == startIdx) ? (startMbIdx % 32) : 0;
            bitEnd = (i == endIdx) ? (endMbIdx % 32) : 31;
            for (uint32_t j = bitStart; j <= bitEnd; j++)
            {
                if (0UL != (intflag[i] & ((uint32_t)1UL << j)))
                {
                    result = i * 32U + j;
                    break;
                }
            }
        }
    }

    /* find Message to deal with. */
    if (result < (uint32_t)FSL_FEATURE_FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(base))
    {
        /* Solve Legacy Rx FIFO interrupt. */
        if (((uint8_t)kFLEXCAN_StateIdle != handle->rxFifoState) && (result <= (uint32_t)CAN_IFLAG1_BUF7I_SHIFT) &&
            ((base->MCR & CAN_MCR_RFEN_MASK) != 0U))
        {
            status = FLEXCAN_SubHandlerForLegacyRxFIFO(base, handle, result);
            /*
             * $Branch Coverage Justification$
             * (status == kStatus_FLEXCAN_RxFifoDisabled) not covered. $ref flexcan_c_ref_1$.
             */
            if (status == kStatus_FLEXCAN_RxFifoDisabled)
            {
                /*
                 * $Line Coverage Justification$
                 * $ref flexcan_c_ref_1$.
                 */
                return status;
            }
        }
        else
        {
            status = FLEXCAN_SubHandlerForMB(base, handle, result);
        }

        /* Clear resolved Message Buffer IRQ. */
#if (defined(FSL_FEATURE_FLEXCAN_HAS_MORE_THAN_64_MB) && FSL_FEATURE_FLEXCAN_HAS_MORE_THAN_64_MB)
        if (result >= 64U)
        {
            FLEXCAN_ClearHigh64MbStatusFlags(base, (uint64_t)1U << (result - 64U));
        }
        else
#endif
        {
            FLEXCAN_ClearMbStatusFlags(base, (uint64_t)1U << result);
        }
    }

